# Сообщения.
WARNING_CAMERA_AND_LENS_INCOMPATIBILITY = ('Выбранная камера и объектив '
                                           'несовместимы из-за разных '
                                           'байонетов. Но не беспокойтесь, это '
                                           'не влияет на расчет. '
                                           'В расчете участвуют только '
                                           'фокусное расстояние, размер '
                                           'сенсора и телеконвертор если '
                                           'выбран.')

ERROR_LOAD_IN_DB = 'Ошибка при загрузке данных из базы'